# CLI Tool
brew 'ffmpeg'
brew 'gh' 
brew 'git'
brew 'mint'
brew 'pure'
brew 'pnpm'
brew 'yt-dlp'
brew 'node'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'fzf'

# Cask
cask_args appdir: '/Applications'
cask 'appcleaner'
cask 'discord'
cask 'google-chrome'
cask 'sf-symbols'
cask 'zoom'
cask 'visual-studio-code'
cask 'raycast'
cask 'notion'
cask 'chatgpt'
cask 'figma'
cask 'claude-code'
cask 'codex'
cask 'microsoft-teams'
cask 'adobe-creative-cloud'


# Font
cask 'font-sf-mono'
cask 'font-sf-pro'
cask 'font-sf-compact'

# App Store
brew 'mas'
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'DaisyDisk', id: 411643860
mas 'The Unarchiver', id: 425424353
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'LINE', id: 539883307
mas 'Developer', id: 640199958
mas 'Slack', id: 803453959
mas 'Shazam', id: 897118787
mas 'Dropover', id: 1355679052
mas 'Velja', id: 1607635845
mas 'XCFormat', id: 1165321484
mas 'Xcode', id: 497799835
