# CLI Tool
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew 'mint'
brew 'pure'
brew 'robotsandpencils/made/xcodes'

# Cask
tap 'homebrew/cask'
cask_args appdir: '/Applications'
cask 'appcleaner'
cask 'discord'
cask 'google-chrome'
cask 'postman'
cask 'sf-symbols'
cask 'sketch'
cask 'ultimaker-cura'
cask 'warp'
cask 'xcodes'
cask 'zoom'

# Font
tap 'homebrew/cask-fonts'
cask 'font-sf-mono'
cask 'font-sf-pro'
cask 'font-sf-compact'

# App Store
brew 'mas'
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'DaisyDisk', id: 411643860
mas 'The Unarchiver', id: 425424353
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'LINE', id: 539883307
mas 'Prime Video', id: 545519333
mas 'Developer', id: 640199958
mas 'Slack', id: 803453959
mas 'Shazam', id: 897118787
mas 'Dropover', id: 1355679052
mas 'Messenger', id: 1480068668